/*
                                ЗАВДАННЯ
Завдання 2.Для програми згідно з заданим варіантом:
•	визначити експериментально, помилки яких класів буде згенеровано;
•	створити обробники виняткових ситуацій з використанням виявлених класів
    та всіх секцій конструкції обробника з відповідними повідомленнями,
    що дозволяють коректно виконати програму.

Завдання виконати у вигляді двох проектів:
1)	без використання власних методів
2)	з використанням методів для кожної підзадачі, які можуть генерувати
    виняткову ситуацію.

У програмі, яка обчислює середнє значення серед негативних елементів одновимірного масиву,
що вводиться з клавіатури (тип елементів int), можуть виникати помилки в таких випадках:
–	введення рядка замість числа;
–	невідповідність числового типу даних;
–	негативні елементи відсутні.
*/
public class Main {
    public static void main(String[] args) {
        Array array = new Array();
        array.enterArraySize(); // ввод в массив
        array.fillArray(); // заполнение массива
        array.printArray();
        System.out.println();
        try {
            System.out.println("Середнє значення серед негативних елементів  = " + array.printMidNumArray());
        } catch (IllegalArgumentException e){
            System.out.println("Помилка: " + e);
        }  finally {
            System. exit(0);
        }
    }
}
