/*
Через контекстне меню потрібного проекту відкрити діалогове вікно Властивості
та встановити потрібні параметри аргументів методу main.
Якщо метод здатний до породження винятків, які він не обробляє,
він повинен бути визначений так, щоб методи, що викликають,
могли самі оберігати від даного виключення.
Для цього використовується ключове слово throws у сигнатурі методу.
Це необхідно для всіх винятків, крім винятків
типу Error і RuntimeException, і, відповідно, для будь-яких підкласів.

Приклад 2.14.Обробка виключення, породженого одним
методом m() у іншому (у методі main).
*/

public class Main {
   // public class Except7 {
        public static void m(int x) throws ArithmeticException {
            int h=10/x;
        }
        public static void main(String[] args){
            try{
                int l = args.length;
                System.out.println("Розмір масиву=" + l);
                m(l);
            } catch (ArithmeticException e) {
                System.out.println("Помилка: Ділення на нуль");
            }
        }
    //}
}