
import java.util.Scanner;
public class FirmaClass {         // головний клас
    public static void main(String[] args) {
          /*
                _______________________________________________________________________________

                                                ЗАВДАННЯ
                    Завдання 1.1.Створити програми, наведені в прикладах 1.1 та 1.2,
                    та відпрацювати їх за допомогою налагоджувача. Приділити увагу
                    операціям створення об'єктів досліджуваних класів.

                    Завдання 1.2. Використовуючи розглянуті у цій роботі приклади
                    1.3 та 1.4, виконати завдання згідно з заданим варіантом,
                    у вигляді двох проектів:
                        1 -	й проект – без використання методів;
                        2 -	й проект – зі створенням методів кожної підзадачі.
                _______________________________________________________________________________
                */
          // 1.1) Task Example №1.1

        Scanner sc = new Scanner(System.in);

        System.out.println("Введіть кількість співробітників => ");
        int kol = sc.nextInt();
        sc.nextLine();        //очищення буфера після введення числа

        Sotrudnik[] sotr = new Sotrudnik[kol]; //отримано посилання на масив співробітників

        System.out.println("Введіть інформацію про кожного співробітника: ");
        for (int i = 0; i < sotr.length; i++) {
            sotr[i] = new Sotrudnik();  // отримано посилання на i-тий елемент

            // Присвоєння значень полям
            System.out.println("Введіть прізвище "+ (i+1) + " співробітника => ");
            sotr[i].fam = sc.nextLine();

            System.out.println("Введіть ім'я " + (i + 1) + " співробітника => ");
            sotr[i].im = sc.nextLine();

            System.out.println("Введіть його по батькові " + (i + 1) + " співробітника => ");
            sotr[i].otch = sc.nextLine();

            System.out.println("Введіть його посаду " + (i + 1) + " співробітника => ");
            sotr[i].doljnost = sc.nextLine();

            System.out.println("Введіть оклад " + (i + 1) + " співробітника => ");
            sotr[i].oklad = sc.nextInt();   //очищення буфера

            sc.nextLine();
        }
    }
}